app/controllers/home_controller.rb

SELECT * FROM `shows` WHERE (`shows`.`featured` = 1) ORDER BY RAND() ASC LIMIT 1
---
  def index
    @popular  = Show.popular.limited
    @rated    = Show.rated.limited
    @featured = Show.featured.random.first || Show.random.first