app/controllers/home_controller.rb

  def index
    @popular           = Show.popular.limited.available.still_showing
    @rated             = Show.rated.limited
    @tonight           = Show.tonight.rated.popular.available.very_limited
    @recent_tweets     = recent_tweets
    @calendar_date     = Time.parse("#{params[:date]}-01") || Time.now
    @performance_dates = Performance.find(:all, :conditions => ["happens_at BETWEEN ? AND ?", @calendar_date, @calendar_date+1.month]).group_by{|p| p.happens_at.to_date}
---
SELECT * FROM `performances` WHERE (`performances`.show_id = 73) LIMIT 1