app/controllers/shows_controller.rb

  def show
    @show    = Show.find params[:id]
---
SELECT * FROM `shows` WHERE (`shows`.`id` = 73)